Tekla Open API Reference for Tekla Structures 2025
ControlArc Class
 The ControlArc class defines a user defined arc helping in modeling work.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.ControlArc
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ControlArc : ModelObject
<SerializableAttribute>
Public NotInheritable Class ControlArc
	Inherits ModelObject
The ControlArc type exposes the following members.
Constructors
Name | Description
ControlArc()
 Creates a new control arc instance.
The default values are as follows:
CenterPoint = Point(0.0, 0.0, 0.0);
StartPoint = Point(0.0, 1000.0, 0.0);
EndPoint = Point(1000.0, 0.0, 0.0);
Color = ControlObjectColorEnum.YELLOW;
ControlArc(Point, Point, Point)
 Creates a new control arc instance taking the 3 points.
Top
Properties
Name | Description
Color
 Gets or sets color of the control arc.
Geometry
 Gets or sets the arc geometry. The arc must not represent a complete circle (i.e. the arc angle must be less than 360 degrees).
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LineType
 The line type of the control arc.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Top
Methods
Name | Description
CompareTo
 Compares Identifiers of model objects.
 (Inherited from ModelObject.)
Delete
 Deletes the control arc with the given Identifier.
 (Overrides ModelObject.Delete().)
Equals
 Check if Identifiers of model objects are same.
 (Inherited from ModelObject.)
GetAllReportProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
 (Inherited from ModelObject.)
GetAllUserProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
 (Inherited from ModelObject.)
GetChildren
 Returns an enumerator of all the children model objects.
 (Inherited from ModelObject.)
GetCoordinateSystem
 Returns the coordinate system for the given model object.
 (Inherited from ModelObject.)
GetCustomObjectType
 Gets custom object type name from an existing object.
 (Inherited from ModelObject.)
GetDoubleReportProperties
 Retrieves multiple double report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetDoubleUserProperties
 Retrieves all double properties for the model object.
 (Inherited from ModelObject.)
GetDynamicStringProperty
 Gets a dynamic string property from the model object.
 (Inherited from ModelObject.)
GetFatherComponent
 Returns the father component of the model object.
 (Inherited from ModelObject.)
GetHierarchicObjects
 Returns an enumerator of all the connected hierarchic objects.
 (Inherited from ModelObject.)
GetIntegerReportProperties
 Retrieves multiple integer report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetIntegerUserProperties
 Retrieves all integer properties for the model object.
 (Inherited from ModelObject.)
GetPhase
 Retrieves the phase of the model object (the phase number, the phase name, the phase comment and whether the phase is the current one or not).
 (Inherited from ModelObject.)
GetReportProperty(String, Double)
 Retrieves a double property of the report for the model object.
 (Inherited from ModelObject.)
GetReportProperty(String, Int32)
 Retrieves an integer property of the report for the model object.
 (Inherited from ModelObject.)
GetReportProperty(String, String)
 Retrieves a string property of the report for the model object.
 (Inherited from ModelObject.)
GetStringReportProperties
 Retrieves multiple string report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetStringUserProperties
 Retrieves all string properties for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, Double)
 Retrieves a double property for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, Int32)
 Retrieves an integer property for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, String)
 Retrieves a string property for the model object.
 (Inherited from ModelObject.)
Insert
 Inserts the control arc into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the control arc with the given Identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the control arc with the given Identifier.
 (Overrides ModelObject.Select().)
SetCustomObjectType
 Sets a custom object type name for an existing object.
 (Inherited from ModelObject.)
SetDynamicStringProperty
 Sets a dynamic string property for the model object.
 (Inherited from ModelObject.)
SetLabel
 Sets a label for an object when a new instance is created, this method must be called before Insert. The label is used in plug-ins for identifying the changed object in modification.
 (Inherited from ModelObject.)
SetPhase
 Sets the phase of the model object.
 (Inherited from ModelObject.)
SetUserProperties
 Sets multiple properties for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, Double)
 Sets a double property for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, String)
 Sets a string property for the model object.
 (Inherited from ModelObject.)
Top
See Also
Reference
Tekla.Structures.Model Namespace